Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དྲན་པ་མེད་ཅིང་ཡིད་ལ་བྱ་བ་མེད་པ་ནི་ཆོས་རྗེས་སུ་དྲན་པའོ།
en: If you ask why, the recollection of the Dharma is without recollection and without attention.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་རྗེས་སུ་དྲན་པ་དེ་ལ་བསླབས་ཤིང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཚུལ་གྱིས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: It is in this way, Subhūti, that bodhisattva great beings who have trained in that recollection of the Dharma will perfect [the goals], up to and including all-aspect omniscience, on the basis of the essential nature of nonentity.

source: །དེ་ནི་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: They will attain consummate buddhahood, [knowing that] all phenomena have the essential nature of nonentity.

source: དེ་ལ་དངོས་པོ་ཡོད་པར་འདུ་ཤེས་པ་འམ། དངོས་པོ་མེད་པའི་འདུ་ཤེས་པ་ཡང་མེད་ན། དྲན་པའི་ལས་རྡུལ་ཙམ་ཡང་ཡོད་པ་འམ། དྲན་པ་དང་བྲལ་བར་འགྱུར་བ་ལྟ་ཅི་ཞིག་སྨོས། རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགེ་འདུན་རྗེས་སུ་དྲན་པ་སྒོམ་པ་ཡིན་ཞེ་ན།
en: Since the perception of entities and the perception of nonentities are both nonexistent in it, how could there possibly be even a speck of actions based on recollection, or without recollection! “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། དགེ་འདུན་རྗེས་སུ་དྲན་པ་སྒོམ་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ཕུན་སུམ་ཚོགས་པའི་སྐྱེས་བུ་ཟུང་བཞི་དང་། སྐྱེས་བུ་གང་ཟག་བརྒྱད་པོ་དེ་དག་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དུ་ཡིད་ལ་བྱེད་དོ།
en: Subhūti, if one were to ask how bodhisattva great beings should cultivate the recollection of the Saṅgha, in this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, in cultivating the recollection of the Saṅgha, they should focus their attention on the community of the śrāvakas of the Blessed One, comprising the four pairs of persons and eight types of individuals who are all endowed with the excellences of ethical discipline, meditative stability, wisdom, liberation, and seeing the wisdom of liberation, on the basis that they are of the essential nature of nonentity.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེ་དག་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: If you ask why, it is because these [persons and types of individuals] are without essential nature.

source: །གང་ལ་ངོ་བོ་ཉིད་མེད་པ་དག་ནི་དངོས་པོ་མེད་པའོ།
en: That which is without essential nature is a nonentity.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དྲན་པ་མེད་ཅིང་ཡིད་ལ་བྱ་བ་མེད་པ་ནི། དགེ་འདུན་རྗེས་སུ་དྲན་པའོ།
en: If you ask why, the recollection of the Saṅgha is without recollection and without attention.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགེ་འདུན་རྗེས་སུ་དྲན་པ་དེ་ལ་བསླབས་ཤིང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཚུལ་གྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: It is in this way, Subhūti, that bodhisattva great beings who have trained in that recollection of the Saṅgha will perfect [the goals], up to and including all-aspect omniscience, on the basis of the essential nature of nonentity. {

source: དེ་ལ་དངོས་པོ་ཡོད་པར་འདུ་ཤེས་པ་འམ། དངོས་པོ་མེད་པར་འདུ་ཤེས་པ་ཡང་མེད་ན། དྲན་པའི་ལས་རྡུལ་ཙམ་ཡང་ཡོད་པ་འམ། དྲན་པ་དང་བྲལ་བར་འགྱུར་བ་ལྟ་ཅི་ཞིག་སྨོས། རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་སྒོམ་པ་ཡིན་ཞེ་ན།
en: Since the perception of entities and the perception of nonentities are both nonexistent in it, how could there possibly be even a speck of actions based on recollection, or without recollection! “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་སྒོམ་ཞིང་། མ་རལ་བ་མ་ཞིག་པ་མ་འདྲེས་པ། སྐྱོན་མེད་པ། མ་ཉམས་པ། མཐུ་དང་ལྡན་པ། མཁས་པས་བསྔགས་པ། ཤིན་དུ་རྫོགས་པའི་ཏིང་ངེ་འཛིན་ཡོངས་སུ་གྲུབ་པའི་ཚུལ་ཁྲིམས་ལ་གནས་པ་ཡིན་ཏེ།
en: Subhūti, if one were to ask how bodhisattva great beings should cultivate the recollection of ethical discipline, in this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, in cultivating the recollection of ethical discipline, they should maintain the ethical discipline of consummate meditative stability that is undamaged, unbroken, unblemished, flawless, nondegenerate, potent, praised by the wise, and utterly perfect, and they should focus their attention on this ethical discipline being of the essential nature of nonentity.

source: དེ་ཚུལ་ཁྲིམས་དེ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དུ་ཡིད་ལ་བྱེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: If you ask why, it is because this [ethical discipline] is without essential nature.

source: དེ་ནི་འདི་ལྟར་དེ་ལ་ངོ་བོ་ཉིད་མེད་དེ། གང་ལ་ངོ་བོ་ཉིད་མེད་པ་དེ་དག་ནི་དངོས་པོ་མེད་པའོ།
en: That which is without essential nature is a nonentity.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དྲན་པ་མེད་ཅིང་ཡིད་ལ་བྱ་བ་མེད་པ་ནི། ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པའོ།
en: If you ask why, the recollection of ethical discipline is without recollection and without attention.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་དེ་ལ་བསླབས་ཤིང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཚུལ་གྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: It is in this way, Subhūti, that bodhisattva great beings who have trained in that recollection of ethical discipline will perfect [the goals], up to and including all-aspect omniscience, on the basis of the essential nature of nonentity.

source: དེ་ལ་དངོས་པོ་ཡོད་པར་འདུ་ཤེས་པ་འམ། དངོས་པོ་མེད་པར་འདུ་ཤེས་པ་ཡང་མེད་ན། དྲན་པའི་ལས་རྡུལ་ཙམ་ཡང་ཡོད་པ་འམ། དྲན་པ་དང་བྲལ་བར་འགྱུར་བ་ལྟ་ཅི་ཞིག་སྨོས། རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ།
en: Since the perception of entities and the perception of nonentities are both nonexistent in it, how could there possibly be even a speck of actions based on recollection, or without recollection! “

source: གཏོང་བ་རྗེས་སུ་དྲན་པར་འགྱུར་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གཏོང་བ་རྗེས་སུ་དྲན་པ་སྒོམ་ཞིང་། གང་ཟང་ཟིང་གཏོང་བ་དང་། ཆོས་གཏོང་བ་ཡིད་ལ་མི་བྱེད་དེ།
en: Subhūti, if one were to ask how, when bodhisattva great beings practice the perfection of wisdom, they should recollect giving away, in this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, in cultivating the recollection of giving away, they should not focus their attention on giving away material things or giving away dharmas.

source: དེ་ཡན་ལག་དང་། ཉིང་ལག་ཀྱང་ཡོངས་སུ་གཏོང་ན། དངོས་པོ་གཞན་ལྟ་ཅི་ཞིག་སྨོས། དེ་ལྟར་སྦྱིན་པ་ཡོངས་སུ་གཏོང་ཡང་། འདི་ལྟར་བདག་ནི་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའོ།
en: Even when giving away their limbs and appendages, let alone other material objects, even when dispensing their generosity in that manner, they should not think, ‘I am giving gifts away.

source: །དངོས་པོ་འདི་གཏོང་བའོ།
en: This thing is being given away.

source: །འདི་ལ་གཏོང་བར་བྱའོ།
en: It should be given away to this [person].’

source: །སྙམ་དུ་མི་སེམས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དངོས་པོ་མེད་པ་དེ་དག་ལ་ངོ་བོ་ཉིད་མེད་དེ།
en: If you ask why, it is because these nonentities are without essential nature.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དྲན་པ་མེད་ཅིང་ཡིད་ལ་བྱ་བ་མེད་པ་ནི་གཏོང་བ་རྗེས་སུ་དྲན་པའོ།
en: If you ask why, the recollection of giving away is without recollection and without attention.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཏོང་བ་རྗེས་སུ་དྲན་པ་ལ་བསླབས་ཤིང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཚུལ་གྱིས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: It is in this way, Subhūti, that bodhisattva great beings who have trained in that recollection of giving away will perfect [the goals], up to and including all-aspect omniscience, on the basis of the essential nature of nonentity.

source: དེ་ལ་དངོས་པོ་ཡོད་པར་འདུ་ཤེས་པ་འམ། དངོས་པོ་མེད་པར་འདུ་ཤེས་པ་ཡང་མེད་ན། དེ་ལ་དྲན་པའི་ལས་རྡུལ་ཙམ་ཡང་ཡོད་པ་འམ། དྲན་པ་དང་བྲལ་བར་འགྱུར་བ་ལྟ་ཅི་ཞིག་སྨོས།
en: In that regard, since the perception of entities and the perception of nonentities are both nonexistent, how could there possibly be even a speck of actions based on recollection, or without recollection! {Ki.

source: རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ལྷ་རྗེས་སུ་དྲན་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷ་རྗེས་སུ་དྲན་པ་སྒོམ་སྟེ། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷར་སྐྱེས་པ་དང་། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་།
en: VI: 10} “Subhūti, one might ask how, when bodhisattva great beings practice the perfection of wisdom, they should recollect the god realms.

source: དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷར་སྐྱེས་པའི་ལྷ་དག་དང་། གཟུགས་ན་སྤྱོད་པ་དང་། གཟུགས་མེད་པ་ན་སྤྱོད་པའི་ཕྱིར་མི་འོང་བ་དེ་དག་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཚུལ་གྱིས་ཡིད་ལ་བྱེད་དོ།
en: In cultivating the recollection of the god realms, Subhūti, bodhisattva great beings, with regard to those who are born among the gods of the Caturmahā­rāja­kāyika realm, the Trayastriṃśa realm, the Yāma realm, the Tuṣita realm, the Nirmāṇarata realm, and the Para­nirmita­vaśa­vartin realm, as well as those frequenting the realm of form and those no longer subject to rebirth who frequent the realm of formlessness, should focus their attention on them on the basis that these are of the essential nature of nonentity.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དྲན་པ་མེད་ཅིང་ཡིད་ལ་བྱ་བ་མེད་པ་ནི་ལྷ་རྗེས་སུ་དྲན་པའོ།
en: If you ask why, the recollection of the god realms is without recollection and without attention.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷ་རྗེས་སུ་དྲན་པ་དེ་ལ་བསླབས་ཤིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: It is in this way, Subhūti, that bodhisattva great beings who have trained in that recollection of the god realms will perfect [the goals], up to and including all-aspect omniscience.

source: རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། མཐར་གྱིས་སྤྱད་པ་དང་། མཐར་གྱིས་བསླབ་པ་དང་། མཐར་གྱིས་འཇུག་པའི་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་འདོད་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཚུལ་གྱིས། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, commencing from the time when they first begin to set their mind on enlightenment, those who wish to perfect the path of the serial practice, serial training, and serial progress should, through focusing their attention with all-aspect omniscience in mind and on the basis of the essential nature of nonentity, train in the perfection of generosity.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: They should train in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: །ནང་སྟོང་པ་ཉིད་ལ་བསླབ་པར་བྱའོ།
en: They should train in the emptiness of internal phenomena.

source: །ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་བསླབ་པར་བྱའོ།
en: They should train in the emptiness of external phenomena, the emptiness of external and internal phenomena, and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་བསླབ་པར་བྱའོ། །ཡང་དག་པར་སྤོང་བ་དང་།
en: They should train in the applications of mindfulness.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་ལ་བསླབ་པར་བྱའོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་།
en: They should train in the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the path.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: They should train in the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་བསླབ་པར་བྱའོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་བསླབ་པར་བྱའོ།
en: They should train in [the goals], up to and including all-aspect omniscience. “

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ལ་སློབ་པའི་མཐར་གྱིས་སྤྱོད་པ་ཡོད་པ་ཡིན། མཐར་གྱིས་བསླབ་པ་ཡོད་པ་ཡིན། མཐར་གྱིས་འཇུག་པའི་ལམ་ཡོད་པ་ཡིན་ཏེ།
en: Subhūti, in that manner bodhisattva great beings engage in serial practice, serial training, and serial progression, training in the essential nature of nonentity with respect to all phenomena.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་མཐར་གྱིས་སྤྱོད་པ་དང་། མཐར་གྱིས་བསླབ་པ་དང་། མཐར་གྱིས་འཇུག་པའི་ལམ་ལ་སློབ་པས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཚུལ་གྱིས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: By training in the path of serial practice, serial training, and serial progression, bodhisattva great beings complete the perfection of generosity.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཚུལ་གྱིས། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: On the basis of the essential nature of nonentity, they complete the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: They complete [all the goals], up to and including all-aspect omniscience.

source: དེ་ལ་དངོས་པོ་ཡང་མེད་ན། གཟུགས་སམ། ཚོར་བ་འམ། འདུ་ཤེས་སམ། འདུ་བྱེད་དམ། རྣམ་པར་ཤེས་པ་འམ། སྐྱེ་མཆེད་རྣམས་སམ། ཁམས་རྣམས་སམ། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་རྣམས་སམ། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་སམ།
en: Since there are no entities in them, how could there possibly exist physical forms, feelings, perceptions, formative predispositions, consciousness, {Ki.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དམ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་སམ། འཕགས་པའི་བདེན་པ་རྣམས་སམ། བསམ་གཏན་རྣམས་སམ། ཚད་མེད་པ་རྣམས་སམ། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སམ། རྣམ་པར་ཐར་པ་རྣམས་སམ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སམ། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་འམ། མངོན་པར་ཤེས་པ་རྣམས་སམ། ཏིང་ངེ་འཛིན་རྣམས་སམ། གཟུངས་ཀྱི་སྒོ་རྣམས་སམ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་སམ། མི་འཇིགས་པ་རྣམས་སམ། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་སམ། བྱམས་པ་ཆེན་པོ་འམ། སྙིང་རྗེ་ཆེན་པོ་འམ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་འམ།
en: VI: 11} any perfections, any aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, the eighteen distinct qualities of the buddhas, or [the goals], up to and including all-aspect omniscience?

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོད་པར་འགྱུར་བ་འམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཡོད་པར་འགྱུར་བ་ལྟ་ག་ལ་ཡོད་དེ།
en: How could there possibly exist the wisdom of all-aspect omniscience?

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་ཆོས་ཐམས་ཅད་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་ལགས་ན། འོ་ན་ནི་གཟུགས་ཀྱང་མ་མཆིས།
en: The venerable Subhūti then asked the Blessed One, “Blessed Lord, if in that manner all phenomena are of the essential nature of nonentity, in that case, there are indeed no physical forms.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་མ་མཆིས།
en: There are indeed no feelings, perceptions, formative predispositions, or consciousness.

source: སྐྱེ་མཆེད་རྣམས་དང་། ཁམས་རྣམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡང་མ་མཆིས། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཡན་ལག་རྣམས་ཀྱང་མ་མཆིས། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་།
en: There are indeed no sense fields, sensory elements, or dependent origination, nor are there any links of dependent origination.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱང་མ་མཆིས། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་
en: There are no perfections, none of the aspects of emptiness, and no thirty-seven factors conducive to enlightenment.

source: མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱང་མ་མཆིས།
en: There are no truths of the noble ones, meditative concentrations, immeasurable attitudes, formless absorptions, aspects of liberation, serial steps of meditative absorption, emptiness, signlessness, wishlessness, extrasensory powers, meditative stabilities, dhāraṇī gateways, powers of the tathāgatas, fearlessnesses, kinds of exact knowledge, great loving kindness, great compassion, or even the distinct qualities of the buddhas.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱི་བར་ཡང་མ་མཆིས།
en: There are no [goals], up to and including the wisdom of all-aspect omniscience. “

source: སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ཡང་མ་མཆིས།
en: There are also no buddhas, Dharma, or saṅgha.

source: ལམ་ཡང་མ་མཆིས། འབྲས་བུ་ཡང་མ་མཆིས། ཉོན་མོངས་པ་ཡང་མ་མཆིས། རྣམ་པར་བྱང་བ་ཡང་མ་མཆིས། འཐོབ་པ་ཡང་མ་མཆིས།
en: There is indeed no path, no fruit, no afflicted mental state, no purification, no attainment, and no clear realization.

source: མངོན་པར་རྟོགས་པ་ཡང་མ་མཆིས།
en: There are no phenomena at all.”

source: ཆོས་ཐམས་ཅད་ཀྱང་མ་མཆིས་པ་ལགས་སམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ལ་ཡོད་པ་འམ་མེད་པ་ཞིག་དམིགས་སུ་ཡོད་སྙམ་འམ། རབ་འབྱོར་གྱིས་གསོལ་པ།
en: The Blessed One then asked, “Subhūti, do you think that it is apprehensible whether all phenomena have or do not have an essential nature of nonentity?” “

source: ཆོས་ཐམས་ཅད་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་ལ་མཆིས་པ་འམ་མ་མཆིས་པ་མི་དམིགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: It is not apprehensible whether all phenomena have or do not have an essential nature of nonentity.” “

source: རབ་འབྱོར་འོ་ན་ཅིའི་ཕྱིར་ཁྱོད་དེ་ལྟར་གལ་ཏེ་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་ན། གཟུགས་ཀྱང་མེད། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་མེད། སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡང་མེད། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱང་མེད། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱང་མེད།
en: In that case, Subhūti,” continued the Blessed One, “if all phenomena are of the essential nature of nonentity, why do you think that there are indeed no physical forms; no feelings, perceptions, formative predispositions, or consciousness; no sense fields, sensory elements, or links of dependent origination; no perfections, aspects of emptiness, or factors conducive to enlightenment; and no truths of the noble ones, meditative concentrations, immeasurable attitudes, formless absorptions, aspects of liberation, serial steps of meditative absorption, emptiness, signlessness, wishlessness, extrasensory powers, meditative stabilities, dhāraṇī gateways, powers of the tathāgatas, fearlessnesses, kinds of exact knowledge, great loving kindness, great compassion, or distinct qualities of the buddhas?

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱི་བར་ཡང་མེད། སངས་རྒྱས་དང་ཆོས་དང་། དགེ་འདུན་ཡང་མེད། ལམ་ཡང་མེད། འབྲས་བུ་ཡང་མེད་ཉོན་མོངས་པ་ཡང་མེད།
en: Why do you think there are no [goals], up to and including the wisdom of all-aspect omniscience; no buddhas, Dharma, or saṅgha; and no path, no fruit, {Ki.

source: རྣམ་པར་བྱང་བ་ཡང་མེད། འཐོབ་པ་ཡང་མེད། མངོན་པར་རྟོགས་པ་ཡང་མེད།
en: VI: 12} no afflicted mental states, no purification, no attainment, and no clear realization—nothing at all?” “

source: ཆོས་ཐམས་ཅད་ཀྱང་མེད་དོ། །ཞེས་བྱ་བར་སེམས་པར་གྱུར། རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ནི་ཆོས་འདི་དག་ལ་ནེམ་ནུར་ཡང་མ་མཆིས། ཐེ་ཚོམ་ཡང་མ་མཆིས་ཏེ། འོན་ཀྱང་བཅོམ་ལྡན་འདས་མ་བྱུང་བའི་དུས་ན།
en: Blessed Lord,” replied Subhūti, “I am without doubt and I am without hesitation regarding all these phenomena.

source: དགེ་སློང་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་འམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་འམ། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་དག་འདི་སྐད་དུ་གལ་ཏེ། ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་ན། ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ལ་སུ་ཞིག །ཀུན་ནས་ཉོན་མོངས་པ་འམ། རྣམ་པར་བྱང་བར་འགྱུར་ཞེས་མཆི་ཞིང་།
en: However, Blessed Lord, in the future there will be monks following the vehicle of the śrāvakas, following the vehicle of the pratyekabuddhas, or following the vehicle of the bodhisattvas who will say, ‘If all phenomena are of the essential nature of nonentity, who will be defiled or purified when all phenomena have the essential nature of nonentity?’

source: དེ་དག་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བར་མ་འཚལ་བས། ཚུལ་ཁྲིམས་ལོག་པར་འགྱུར། ལྟ་བ་ལོག་པར་འགྱུར། སྤྱོད་པ་ལོག་པར་འགྱུར། འཚོ་བ་ལོག་པར་འགྱུར་ཏེ། ཚུལ་ཁྲིམས་ལོག་པར་གྱུར་པ་དང་།
en: Since they will not understand affliction and purification, they will resort to immorality, mistaken views, misconduct, and wrong livelihood.

source: ལྟ་བ་ལོག་པར་གྱུར་པ་དང་། སྤྱོད་པ་ལོག་པར་གྱུར་པ་དང་། འཚོ་བ་ལོག་པར་གྱུར་པ་དེ་དག་སེམས་ཅན་དམྱལ་བ་འམ། བྱོལ་སོང་གི་སྐྱེ་གནས་སམ། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་ངན་སོང་གསུམ་ལས་གཅིག་ཏུ་མཆི་བར་འགྱུར་ཏེ།
en: Those who resort to immorality, mistaken views, misconduct, and wrong livelihood will be reborn in one of the three lower realms—the hells, the animal realm, or the world of Yama.

source: བཅོམ་ལྡན་འདས་བདག་གིས་མ་བྱུང་བའི་འཇིགས་པ་དེ་དག་མཐོང་ནས། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་དོན་དེ་ཞུས་པ་ལགས་ཀྱི། བཅོམ་ལྡན་འདས་བདག་ནི་ཆོས་འདི་དག་ལ་ནེམ་ནུར་རམ། ཐེ་ཚོམ་མ་མཆིས་སོ།
en: Blessed Lord, seeing these fears that have not yet arisen, I ask the tathāgata, arhat, completely awakened Buddha about this matter, although, Blessed Lord, I am without doubt and without hesitation regarding these phenomena.”

source: །དེ་དེ་བཞིན་ཏེ། ཇི་སྐད་དུ་སྨྲས་པ་དེ་བཞིན་ནོ།
en: It is as you have said.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་ལྔ་བཅུ་དགུ་པའོ།། །།
en: This completes the fifty-ninth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”
